# AreWorksheetGridLinesVisible

## Description
Determines the status of the grid lines visibility for the specified worksheet.

```pascal
FUNCTION AreWorksheetGridLinesVisible(h : HANDLE): BOOLEAN;
```

```python
def vs.AreWorksheetGridLinesVisible(h):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to worksheet.|

## Version
Availability: from Vectorworks 2011

## Category
* Worksheets